{
	"_name_or_path": "BlackSamorez/TinyLlama-1_1B-Chat-v1_0-AQLM-2Bit-1x16-hf",
	"architectures": [
	  "LlamaForCausalLM"
	],
	"attention_bias": false,
	"attention_dropout": 0.0,
	"bos_token_id": 1,
	"eos_token_id": 2,
	"hidden_act": "silu",
	"hidden_size": 2048,
	"id2label": {
	  "0": "xIntent",
	  "1": "xReact",
	  "2": "xAttr",
	  "3": "xEffect",
	  "4": "xWant",
	  "5": "xNeed"
	},
	"initializer_range": 0.02,
	"intermediate_size": 5632,
	"label2id": {
	  "xAttr": 2,
	  "xEffect": 3,
	  "xIntent": 0,
	  "xNeed": 5,
	  "xReact": 1,
	  "xWant": 4
	},
	"max_position_embeddings": 2048,
	"model_type": "llama",
	"num_attention_heads": 32,
	"num_hidden_layers": 22,
	"num_key_value_heads": 4,
	"pretraining_tp": 1,
	"problem_type": "single_label_classification",
	"quantization_config": {
	  "linear_weights_not_to_quantize": [
		"model.layers.0.input_layernorm.weight",
		"model.layers.0.post_attention_layernorm.weight",
		"model.layers.1.input_layernorm.weight",
		"model.layers.1.post_attention_layernorm.weight",
		"model.layers.2.input_layernorm.weight",
		"model.layers.2.post_attention_layernorm.weight",
		"model.layers.3.input_layernorm.weight",
		"model.layers.3.post_attention_layernorm.weight",
		"model.layers.4.input_layernorm.weight",
		"model.layers.4.post_attention_layernorm.weight",
		"model.layers.5.input_layernorm.weight",
		"model.layers.5.post_attention_layernorm.weight",
		"model.layers.6.input_layernorm.weight",
		"model.layers.6.post_attention_layernorm.weight",
		"model.layers.7.input_layernorm.weight",
		"model.layers.7.post_attention_layernorm.weight",
		"model.layers.8.input_layernorm.weight",
		"model.layers.8.post_attention_layernorm.weight",
		"model.layers.9.input_layernorm.weight",
		"model.layers.9.post_attention_layernorm.weight",
		"model.layers.10.input_layernorm.weight",
		"model.layers.10.post_attention_layernorm.weight",
		"model.layers.11.input_layernorm.weight",
		"model.layers.11.post_attention_layernorm.weight",
		"model.layers.12.input_layernorm.weight",
		"model.layers.12.post_attention_layernorm.weight",
		"model.layers.13.input_layernorm.weight",
		"model.layers.13.post_attention_layernorm.weight",
		"model.layers.14.input_layernorm.weight",
		"model.layers.14.post_attention_layernorm.weight",
		"model.layers.15.input_layernorm.weight",
		"model.layers.15.post_attention_layernorm.weight",
		"model.layers.16.input_layernorm.weight",
		"model.layers.16.post_attention_layernorm.weight",
		"model.layers.17.input_layernorm.weight",
		"model.layers.17.post_attention_layernorm.weight",
		"model.layers.18.input_layernorm.weight",
		"model.layers.18.post_attention_layernorm.weight",
		"model.layers.19.input_layernorm.weight",
		"model.layers.19.post_attention_layernorm.weight",
		"model.layers.20.input_layernorm.weight",
		"model.layers.20.post_attention_layernorm.weight",
		"model.layers.21.input_layernorm.weight",
		"model.layers.21.post_attention_layernorm.weight",
		"model.embed_tokens.weight",
		"model.norm.weight",
		"lm_head.weight"
	  ],
	  "nbits_per_codebook": 16,
	  "in_group_size": 8,
	  "out_group_size": 1,
	  "num_codebooks": 1,
	  "quant_method": "aqlm"
	},
	"rms_norm_eps": 1e-05,
	"rope_scaling": null,
	"rope_theta": 10000.0,
	"tie_word_embeddings": false,
	"torch_dtype": "float16",
	"transformers_version": "4.38.2",
	"use_cache": true,
	"vocab_size": 32000
  }