{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "LlamaForSequenceClassification",
    "parent_library": "transformers.models.llama.modeling_llama"
  },
  "base_model_name_or_path": "BlackSamorez/TinyLlama-1_1B-Chat-v1_0-AQLM-2Bit-1x16-hf",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.01,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj",
    "k_proj",
    "o_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}